app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Peter"], ["email", "hjkdsa@dsdas"], ["password", "dsaadsads"], ["created_at", 2016-09-22 23:44:50 UTC], ["updated_at", 2016-09-22 23:44:50 UTC]]
---
	def create
		user = User.create(user_params)